<a href="https://colab.research.google.com/github/SDS-AAU/DSBA-2021/blob/master/static/notebooks/DSBA21_A2_W1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Danish Elite Network

In [1]:
import pandas as pd
import networkx as networkx
from community import community_louvain

In [2]:
data = pd.read_csv('https://github.com/SDS-AAU/SDS-master/raw/master/00_data/networks/elite_den17.csv')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56849 entries, 0 to 56848
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   NAME             56849 non-null  object
 1   AFFILIATION      56849 non-null  object
 2   ROLE             54312 non-null  object
 3   TAGS             54809 non-null  object
 4   POSITION_ID      56849 non-null  int64
 5   ID               56849 non-null  int64
 6   SECTOR           54500 non-null  object
 7   TYPE             36116 non-null  object
 8   DESCRIPTION      47785 non-null  object
 9   CREATED          56828 non-null  object
 10  ARCHIVED         0 non-null      float64
 11  LAST_CHECKED     56820 non-null  object
 12  CVR_PERSON       23659 non-null  float64
 13  CVR_AFFILIATION  23712 non-null  float64
 14  PERSON_ID        56849 non-null  int64
 15  AFFILIATION_ID   56849 non-null  int64
dtypes: float64(3), int64(4), object(9)
memory usage: 6.9+ MB

In [3]:
data.head()

               NAME  ... AFFILIATION_ID
0      Aage Almtoft  ...           3687
1  Aage B. Andersen  ...           2528
2  Aage Christensen  ...            237
3          Aage Dam  ...            469
4          Aage Dam  ...           1041

[5 rows x 16 columns]

In [5]:
data.SECTOR.value_counts()

NGO             17720
State           13601
Corporations     7989
Foundations      6987
VL_networks      3803
Events           1948
Parliament       1087
Commissions       795
Municipal         320
Family            207
Politics           37
Organisation        6
Name: SECTOR, dtype: int64

In [6]:
data = data[data.SECTOR == 'Corporations']

In [7]:
data_select = data[['NAME','PERSON_ID','AFFILIATION_ID']]

In [11]:
data_select

                              NAME  PERSON_ID  AFFILIATION_ID
0                     Aage Almtoft          1            3687
1                 Aage B. Andersen          3            2528
2                 Aage Christensen          4             237
3                         Aage Dam          5             469
4                         Aage Dam          5            1041
...                            ...        ...             ...
56844  Jacob Aarup-Andersen 195767     195767             932
56845        Carsten Rasch Egeriis     195805             932
56846               Marina Lønning     197733            4608
56847        Jaap-Jan Linze Postma     197736            4608
56848     Andreas Albert Pfisterer     197737            4608

[56849 rows x 3 columns]

In [8]:
edges = pd.merge(data_select, data_select, on= 'AFFILIATION_ID')

In [9]:
edges = edges[edges.PERSON_ID_x != edges.PERSON_ID_y]

In [10]:
edges.head()

         NAME_x  PERSON_ID_x  ...                  NAME_y PERSON_ID_y
1  Aage Almtoft            1  ...              Allan Buch         311
2  Aage Almtoft            1  ...     Bo Skovby Rosendahl        4491
3  Aage Almtoft            1  ...           Bo Smith 4493        4493
4  Aage Almtoft            1  ...  Martin Nørholm Baltser       24816
5  Aage Almtoft            1  ...        Pia Kjær Nielsen       31093

[5 rows x 5 columns]